# Работа с SQLlite

https://sqliteonline.com/

In [71]:
pip install prettytable

Requirement already satisfied: prettytable in c:\users\мвидео\appdata\local\programs\python\python312\lib\site-packages (3.10.0)
Requirement already satisfied: wcwidth in c:\users\мвидео\appdata\roaming\python\python312\site-packages (from prettytable) (0.2.13)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [72]:
import sqlite3
from prettytable import from_db_cursor

In [73]:
import os

TEMP_DIR = 'temp'
if not os.path.exists(TEMP_DIR):
    os.mkdir(TEMP_DIR)

# Прмер вызова
os.path.join(TEMP_DIR, "temp_SQLite.db")

'temp\\temp_SQLite.db'

In [74]:
#db_name = os.path.join(TEMP_DIR, "temp_SQLite.db")    
db_name = ":memory:"

if os.path.isfile(db_name):
    os.remove(db_name)
    print(f"Файл [{db_name}] Удален")

db = sqlite3.connect(db_name)
cur = db.cursor()

In [75]:
cur.execute("CREATE TABLE cities (id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, name VARCHAR(100) UNIQUE)")
print(from_db_cursor(cur))

None

In [76]:
cur.execute("PRAGMA table_info('cities')")
print(from_db_cursor(cur))

+-----+------+--------------+---------+------------+----+
| cid | name |     type     | notnull | dflt_value | pk |
+-----+------+--------------+---------+------------+----+
|  0  |  id  |   INTEGER    |    1    |    None    | 1  |
|  1  | name | VARCHAR(100) |    0    |    None    | 0  |
+-----+------+--------------+---------+------------+----+

In [77]:
cur.execute("INSERT INTO cities(name) VALUES ('Севастополь')")

cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+-------------+
| id |     name    |
+----+-------------+
| 1  | Севастополь |
+----+-------------+

In [78]:
cities = "Москва, Уфа, Калуга".split(', ')
cities

['Москва', 'Уфа', 'Калуга']

In [79]:
[(i,) for i in cities]

[('Москва',), ('Уфа',), ('Калуга',)]

In [80]:
cur.executemany("INSERT INTO cities(name) VALUES (?)", [(i,) for i in cities])

In [81]:
cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+-------------+
| id |     name    |
+----+-------------+
| 1  | Севастополь |
| 2  |    Москва   |
| 3  |     Уфа     |
| 4  |    Калуга   |
+----+-------------+

In [82]:
cur.execute("SELECT * FROM cities")
print(type(cur))
print(*cur)

<class 'sqlite3.Cursor'>
(1, 'Севастополь') (2, 'Москва') (3, 'Уфа') (4, 'Калуга')

In [83]:
sql_insert = "INSERT INTO cities(name) VALUES (:city)"
cur.execute(sql_insert, {"city": "London"})

cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+-------------+
| id |     name    |
+----+-------------+
| 1  | Севастополь |
| 2  |    Москва   |
| 3  |     Уфа     |
| 4  |    Калуга   |
| 5  |    London   |
+----+-------------+

In [84]:
sql_delete = "DELETE FROM cities WHERE id = ?"
cur.execute(sql_delete, [5])

cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+-------------+
| id |     name    |
+----+-------------+
| 1  | Севастополь |
| 2  |    Москва   |
| 3  |     Уфа     |
| 4  |    Калуга   |
+----+-------------+

In [86]:
sql_update = """
UPDATE cities
SET name = 'г. ' || name
WHERE id = 1
  AND name NOT LIKE 'г.%'
"""
cur.execute(sql_update)

cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+----------------+
| id |      name      |
+----+----------------+
| 1  | г. Севастополь |
| 2  |     Москва     |
| 3  |      Уфа       |
| 4  |     Калуга     |
+----+----------------+

In [87]:
# Извлечь все
cur.execute("SELECT * FROM cities")
t = cur.fetchall()

print(type(t))
print(t[0])
print(t[0:2])

<class 'list'>
(1, 'г. Севастополь')
[(1, 'г. Севастополь'), (2, 'Москва')]

In [88]:
print(cur.execute("SELECT * FROM cities").fetchone())

(1, 'г. Севастополь')

In [91]:
print(cur.execute("SELECT * FROM cities").fetchall()[:3])

[(1, 'г. Севастополь'), (2, 'Москва'), (3, 'Уфа')]

In [92]:
print(cur.execute("SELECT * FROM cities LIMIT 3").fetchall())

[(1, 'г. Севастополь'), (2, 'Москва'), (3, 'Уфа')]

In [93]:
print(cur.execute("SELECT * FROM cities").fetchmany(size=3))

[(1, 'г. Севастополь'), (2, 'Москва'), (3, 'Уфа')]